FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Flash.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corp. and is
* only intended for use with Renesas products.  

* No other uses are authorized.

* This software is owned by Renesas Electronics Corp. and is 
* protected under the applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY,
* INCLUDING BUT NOT LIMITED TO WAWRRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH
* WARRANTIES ARE EXPRESSLY DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER 
* RENESAS ELECTRONICS CORP. NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR AND DIRECT, INDIRECT, SPECIAL, INCIDENTAL
* OR COSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE,
* EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE
* POSSIBILITIES OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this
* software and to discontinue availability of this software.
* By using this software, you agree to the additional terms and 
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
*******************************************************************************/
/* Copyright (C) 2010. Renesas Electronics Corp., All Rights Reserved         */
/******************************************************************************
* File Name     : Flash_API_RX600.c
* Version       : 1.42
* Device(s)     : R5F562N8
* Tool-Chain    : Renesas RX Standard Toolchain 1.0.1
* OS            : None
* H/W Platform  : YRDKRX62N
* Description   : Flash programming for the RX600 Group
* Limitations   : None
*******************************************************************************
* History : DD.MMM.YYYY   Version    Description
*         : 21.Dec.2009   1.00       First Release
*         : 13.Jan.2010   1.10       Made function names and variables RAPI compliant
*         : 11.Feb.2010   1.20       Fixed other RAPI issues and fixed I flag issue
*         : 29.Apr.2010   1.30       Added support for RX621/N Group. Moved most
*                                    device specific data to header file.
*         : 26.May.2010   1.40       Added support for RX62T Group
*         : 28.Jul.2010   1.41       Fixed bug when performing a blank check on an
*                                    entire data flash block.  Also declared 
*                                    functions not in the API as 'static'.
*          : 23.Aug.2010   1.42      Updated source to raise the coding standard, to
*                                    meet GSCE & RDK standards.
*******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Intrinsic functions of MCU */
#include <machine.h>

/* Function prototypes and device specific info needed for Flash API */
#include "RX62N_Flash.h"
#include "iodefine.h"

/******************************************************************************
Typedef definitions
******************************************************************************/

/******************************************************************************
Macro definitions
******************************************************************************/
/*  The number of ICLK ticks needed for 35us delay are calculated below */
#define    WAIT_tRESW (35*96.0)                    
/*  The number of ICLK ticks needed for 10us delay are calculated below */
#define    WAIT_t10USEC (10*96.0)        
/* This macro was defined in the Flash_API_RXxxx.h file and will 
   create an array of flash addresses called block_addresses.  It is
   used for getting the write addresses of flash blocks */
DEFINE_ADDR_LOOKUP

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
/* Signals whether FCU firmware has been transferred to the FCU RAM 
   0 : No, 1 : Yes */
uint8_t fcu_transfer_complete = 0;

/******************************************************************************
Private global variables and functions
******************************************************************************/
/* Valid values are 'READ_MODE','ROM_PE_MODE' or 'FLD_PE_MODE' */
uint8_t current_mode;         
/* Stores whether interrupts were enabled when flash operation was called */
static uint8_t psw_i_bit;             
/* Flash intialisation function prototype */
static uint8_t _Flash_Init(void);
/* Enter PE mode function prototype */
static uint8_t _Enter_PE_Mode( uint32_t flash_addr, uint16_t bytes );
/* Exit PE mode function prototype */
static void _Exit_PE_Mode(void);
/* ROM write function prototype */
static uint8_t _ROM_Write(uint32_t address, uint32_t data);
/* Data flash write function prototype */
static uint8_t _DataFlash_Write(uint32_t address, uint32_t data, uint8_t size);
/* Data flash status clear function prototype */
static void _DataFlash_Status_Clr(void);
/* Notify peripheral clock function prototype */
static uint8_t _Notify_Peripheral_Clock(volatile uint8_t * flash_addr);
/* FCU reset function prototype */
static void    _Flash_Reset(void);

/******************************************************************************
* Function Name: _Flash_Init
* Description  : Initializes the FCU peripheral block.
    NOTE: This function does not have to execute from in RAM.
* Arguments    : none
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
******************************************************************************/
static uint8_t _Flash_Init(void)
{
    /* Declare source and destination pointers */
    uint32_t * src, * dst;

    /* Declare iteration counter variable */
    uint16_t i;

    /* Disable FCU interrupts */
    FLASH.FRDYIE.BIT.FRDYIE = 0;

    /* Disable FCU interrupts in FCU block */
    FLASH.FAEINT.BIT.ROMAEIE = 0;
    FLASH.FAEINT.BIT.CMDLKIE = 0;
    FLASH.FAEINT.BIT.DFLAEIE = 0;
    FLASH.FAEINT.BIT.DFLRPEIE = 0;
    FLASH.FAEINT.BIT.DFLWPEIE = 0;

    /* Disable FCU interrupts in ICU */

    /* Disable flash interface error (FIFERR) */
    IPR(FCU, FIFERR) = 0;
    IEN(FCU, FIFERR) = 0;
    /* Disable flash ready interrupt (FRDYI) */
    IPR(FCU, FRDYI) = 0;
    IEN(FCU, FRDYI) = 0;

