FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Flash.c
        /* Return 2, operation failure */
        return 2;
    }

    /* Set  bit FRDMD (bit 4) in FMODR to 1 */
    FLASH.FMODR.BIT.FRDMD = 1;

    /* Check if 8 byte size has been passed */
    if (size == BLANK_CHECK_8_BYTE)
    {
        /* Set data flash pointer to beginning of the memory block */
        ptrb = (uint8_t *)(address & DF_MASK);    

        /* Check if the next 8 bytes are blank
           Bits BCADR to the address of the 8-byte location
           to check (only bits A3-A12).
           Set bit BCSIZE in EEPBCCNT to 0. */
        FLASH.DFLBCCNT.WORD = (uint16_t)(address & (DF_BLOCK_SIZE-8));
    }
    /* Check entire data block */
    else
    {
        /* Any address in the erasure block */
        ptrb = (uint8_t *)address;

        /* Check if the entire block is blank
           Set bit BCSIZE in EEPBCCNT to 1.
           Bits BCADR are not used, set to '0'. */
        FLASH.DFLBCCNT.WORD = 0x0001;
    }

    /* Send commands to FCU */
    *ptrb = 0x71;
    *ptrb = 0xD0;

    /* Check 'FRDY' bit */
    while ( FLASH.FSTATR0.BIT.FRDY == 0 )
    {
        /* Wait till ready */
    }

    /* Reset the FRDMD bit back to 0 */
    FLASH.FMODR.BIT.FRDMD = 0x00;

    /* Check if the 'ILGERR' was set during the command */
    if (FLASH.FSTATR0.BIT.ILGLERR == 1)    /* Check 'ILGERR' bit */
    {
        /* Take the FCU out of PE mode */
        _Exit_PE_Mode( );

        /* Set the FCU mode to READ */
        current_mode = READ_MODE;

        /* Return 2, operation failure */
        return 2;
    }

    /* (Read the 'BCST' bit (bit 0) in the 'DFLBCSTAT' register
       0=blank, 1=not blank */
    result = FLASH.DFLBCSTAT.BIT.BCST;    

    /* Take the FCU out of PE mode */
    _Exit_PE_Mode( );

    /* Set the current mode to READ */
    current_mode = READ_MODE;

    /* Return 1/0 (Not Blank/Blank), operation successful */
    return( result );
}
/******************************************************************************
End of function  R_FlashDataAreaBlankCheck
******************************************************************************/

/******************************************************************************
* Function Name: R_FlashDataAreaAccess
* Description  : 
    This function is used to allow read and program permissions to the Data
    Flash areas.
    NOTE: This function does not have to execute from in RAM.
* Arguments    : 
    read_en_mask
      Bitmasked value. Bits 0-3 represents each Data Blocks 0-3 (respectively).
          '0'=no Read access. '1'=Allows Read by CPU
    write_en_mask
      Bitmasked value. Bits 0-3 represents each Data Blocks 0-3 (respectively).
          '0'=no Erase/Write access. '1'=Allows Erase/Write by FCU
* Return Value : none
******************************************************************************/
void R_FlashDataAreaAccess(uint16_t read_en_mask, uint16_t write_en_mask)
{


    /* Set Read access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLRE0.WORD = 0x2D00 | (read_en_mask & 0x00FF);

    /* Set Read access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLRE1.WORD = 0xD200 | ((read_en_mask >> 8) & 0x00FF);

    /* Set Erase/Program access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLWE0.WORD = 0x1E00 |  (write_en_mask & 0x00FF);

    /* Set Erase/Program access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLWE1.WORD = 0xE100 |  ((write_en_mask >> 8) & 0x00FF);
}

#if ENABLE_ROM_PROGRAMMING
    #pragma section FRAM
#endif
/******************************************************************************
End of function  R_FlashDataAreaAccess
******************************************************************************/

/******************************************************************************
* Function Name: _ROM_Write
* Description  : Write 256 bytes to ROM Area Flash.
    NOTE: This function MUST execute from in RAM.
* Arguments    : none
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
******************************************************************************/
static uint8_t _ROM_Write(uint32_t address, uint32_t data)
{
    /* Declare iteration loop count variable */
    uint8_t i;

    /* Declare wait counter variable */
    int32_t wait_cnt;

    /* Write the FCU Program command */
    *(volatile uint8_t *)address = 0xE8;    
    *(volatile uint8_t *)address = 0x80;

    /* Write 256 bytes into flash, 16-bits at a time */
    for (i = 0; i < 128; i++)
    {
        /* Copy data from source address to destination ROM */
        *(volatile uint16_t *)address = *(uint16_t *)data;

        /* Increment destination address by 2 bytes */
        data += 2;
    }

    /* Write the final FCU command for programming */
    *(volatile uint8_t *)address = 0xD0;

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_ROM_WRITE;

    /* Wait until FCU operation finishes, or a timeout occurs */
    while (FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (wait_cnt == 0)
        {
            /* Maximum timeout duration for writing to ROM has elapsed - 
               assume operation failure and reset the FCU */
            _Flash_Reset();

            /* Return 1, operation failure */
            return 1;
        }
    }

    /* Check for illegal command or programming errors */
    if ((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR  == 1))
    {
        /* Return 1, operation failure */
        return 1;
    }

    /* Return 0, operation successful */
    return 0;
}
/******************************************************************************
End of function  _ROM_Write
******************************************************************************/

/******************************************************************************
* Function Name: _Enter_PE_Mode
* Description  : 
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.
* Arguments    :     bytes
    The number of bytes you are writing (if you are writing).  This argument
    is used to determine if you are crossing the 1MB boundary in ROM.  If you
    do cross this boundary then FENTRY0 and FENTRY1 both need to be set.
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
******************************************************************************/
static uint8_t _Enter_PE_Mode( uint32_t flash_addr, uint16_t bytes )
{
    /* FENTRYR must be 0x0000 before bit FENTRY0 or FENTRYD can be set to 1 */
    FLASH.FENTRYR.WORD = 0xAA00;

    /* Execute null operations to allow FENTRYR register to settle */
    nop();
    nop();

    /* Check if FCU mode is set to ROM PE */
    if ( current_mode == ROM_PE_MODE)
    {
        /* See if interrupts were already disabled,    so as not to enable them
           when leaving. Store interrupt enabled flag locally */
        if ((get_psw() & I_FLAG) == 0)
        {
            psw_i_bit = 0;
        } else
        {
            psw_i_bit = 1;
        }

        /* Disable Interrupts because the interrupt vector table may not
            be accessible */
        set_psw(get_psw() & (~I_FLAG));

        /* Check which partition of flash this address is in */
        if (flash_addr >= 0x00F00000)
        {
            /* Enter ROM PE mode for addresses 0xFFF00000 - 0xFFFFFFFF */
            FLASH.FENTRYR.WORD = 0xAA01;
        } else
        {
            /* Enter ROM PE mode for addresses 0xFFE00000 - 0xFFEFFFFF */
            FLASH.FENTRYR.WORD = 0xAA02;
        }

