FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Flash.c
    }
    /* Check if FCU mode is set to data flash PE */
    else if ( current_mode == FLD_PE_MODE )
    {
        /* Set FENTRYD bit(Bit 7) and FKEY (B8-15 = 0xAA) */
        FLASH.FENTRYR.WORD = 0xAA80;    

        /*  First clear the FCU's status before doing Data Flash programming.
            This is to clear out any previous errors that may have occured.
            For example, if you attempt to read the Data Flash area 
            before you make it readable using R_FlashDataAreaAccess(). */
        _DataFlash_Status_Clr();

    }
    /* Catch-all for invalid FCU mode */
    else
    {
        /* Invalid value of 'current_mode' */
        return 1;
    }

    /* Enable Write/Erase of ROM/Data Flash */
    FLASH.FWEPROR.BYTE = 0x01;

    /* Check for FCU error */
    if (        (FLASH.FSTATR0.BIT.ILGLERR == 1)
                ||    (FLASH.FSTATR0.BIT.ERSERR  == 1)
                ||    (FLASH.FSTATR0.BIT.PRGERR  == 1)
                ||    (FLASH.FSTATR1.BIT.FCUERR  == 1))
    {
        /* Enable Interrupts if I flag was set initially (ROM PE Mode only) */
        if (psw_i_bit == 1)
        {
            /* Restore original interrupt enable flag status */
            set_psw(get_psw() | (I_FLAG));
        }

        /* Return 1, operation failure */
        return 1;     
    }

    /* Return 0, operation successful */
    return 0;
}
/******************************************************************************
End of function _Enter_PE_Mode
******************************************************************************/

/******************************************************************************
* Function Name: _Exit_PE_Mode
* Description  : 
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void _Exit_PE_Mode( void )
{
    /* Declare wait timer count variable */
    int32_t    wait_cnt;

    /* Declare address pointer */
    volatile uint8_t *pAddr;

    /* Set wait timer count duration */     
    wait_cnt = WAIT_MAX_ERASE;

    /* Iterate while loop whilst FCU operation is in progress */
    while (FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement wait timer count variable */
        wait_cnt--;                            

        /* Check if wait timer count value has reached zero */
        if (wait_cnt == 0)
        {
            /* Timeout duration has elapsed, assuming operation failure and
               resetting the FCU */
            _Flash_Reset();            

            /* Break from the while loop prematurely */
            break;
        }
    }

    /* Check FSTATR0 and execute a status register clear command if needed */
    if (        (FLASH.FSTATR0.BIT.ILGLERR == 1) 
                ||  (FLASH.FSTATR0.BIT.ERSERR  == 1) 
                ||  (FLASH.FSTATR0.BIT.PRGERR  == 1))
    {

        /* Clear ILGLERR */
        if (FLASH.FSTATR0.BIT.ILGLERR == 1)
        {
            /* FASTAT must be set to 0x10 before the status clear command
               can be successfully issued  */
            if (FLASH.FASTAT.BYTE != 0x10)
            {
                /* Set the FASTAT register to 0x10 so that a status clear
                    command can be issued */
                FLASH.FASTAT.BYTE = 0x10;
            }
        }

        /* Issue a status register clear command to clear all error bits */
        if ( current_mode == ROM_PE_MODE )
        {
            /* Set address pointer to ROM area */
            pAddr = (uint8_t *)ROM_PE_ADDR;

            /* Send status clear command to FCU */
            *pAddr = 0x50;
        } else
        {
            /* Set address pointer to data flash area */
            pAddr = (uint8_t *)DF_ADDRESS;

            /* Send status clear command to FCU */
            *pAddr = 0x50;
        }
    }

    /* Enter ROM Read mode */
    FLASH.FENTRYR.WORD = 0xAA00;                

    /* Flash write/erase disabled */
    FLASH.FWEPROR.BYTE = 0x02;

    /* Restore the imask value (ROM PE Mode only) */
    if ( current_mode == ROM_PE_MODE )
    {
        /* Enable Interrupts if I flag was set initially (ROM PE Mode only) */
        if (psw_i_bit == 1)
        {
            /* Restore original interrupt enable flag status */
            set_psw(get_psw() | (I_FLAG));
        }
    }

}
/******************************************************************************
End of function  _Exit_PE_Mode
******************************************************************************/

/******************************************************************************
* Function Name: R_FlashErase
* Description  : Erases an entire flash block.
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.

* Arguments    : 
    block
        The block number to erase (BLOCK_0, BLOCK_1, etc...)
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
******************************************************************************/
uint8_t R_FlashErase (uint8_t block)
{
    /* Declare address pointer */
    volatile uint8_t *pAddr;

    /* Declare erase operation result container variable */
    uint8_t result = 0;

    /* Declare timer wait count variable */
    int32_t wait_cnt;

    /* Erase Command Address */
    pAddr = (volatile uint8_t *)(block_addresses[ block ]);

    /* Check for FCU operation to complete */
    if ( !fcu_transfer_complete )
    {
        /* Initialise the FCU, and store operation resilt in result variable */
        result = _Flash_Init();    

        /* Check if FCU initialisation was successful */
        if ( result != 0x00 )
        {
            /* FCU initialisiation failed - return 1, operation failure */
            return 1;
        }
    }

    /* Make sure we are not in the middle of another operation */
    if ( current_mode != READ_MODE )
    {
        /* Currently in the middle of doing something else */
        return 1;     
    }

    /* Do we want to erase a Data Flash block or ROM block? */
    if ( block >= BLOCK_DB0 )
    {
        /* Set current FCU mode to data flash PE */
        current_mode = FLD_PE_MODE;
    } else
    {
        /* Set current FCU mode to ROM PE */
        current_mode = ROM_PE_MODE;
    }

    /* Enter ROM PE mode, check if operation successful */
    if ( _Enter_PE_Mode((uint32_t)pAddr, 0) != 0)
    {
        /* Enter PE mode operation failed, set current mode to READ */
        current_mode = READ_MODE;

        /* Return 1, operation failure */
        return 1;
    }

    /* Inform FCU of peripheral clock speed, check if operation is succesful */
    if ( _Notify_Peripheral_Clock(pAddr) != 0)
    {
        /* Notify operation failed, set FCU mode to READ */
        current_mode = READ_MODE;

        /* Return 1, operation failure */
        return 1;
    }

    /* Cancel the ROM Protect feature 
       NOTE: If you are using block locking feature to protect your data,
       remove the following line */
    FLASH.FPROTR.WORD = 0x5501;

    /* Send the FCU Command */
    *pAddr = 0x20;
    *pAddr = 0xD0;

    /* Set the wait counter timeout duration */
    wait_cnt = WAIT_MAX_ERASE;

    /* Wait while FCU operation is in progress */
    while (FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (wait_cnt == 0)
        {

