FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Flash.c
            /* Maximum timeout duration for erasing a ROM block has 
               elapsed, assuming operation failure - reset the FCU */
            _Flash_Reset();

            /* Return 1, operation failure */
            return 1;
        }
    }

    /* Check if erase operation was successful by checking 
       bit 'ERSERR' (bit5) and 'ILGLERR' (bit 6) of register 'FSTATR0' */
    /* Check FCU error */
    if ((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.ERSERR  == 1))
    {
        result = 1;
    }

    /* Leave Program/Erase Mode */
    _Exit_PE_Mode();

    /* Set FCU mode to READ */
    current_mode = READ_MODE;

    /* Return erase result, operation succesful */
    return result;
}
/******************************************************************************
End of function  R_FlashErase
******************************************************************************/

/******************************************************************************
* Function Name: R_FlashWrite
* Description  : Writes bytes into flash.
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.

* Arguments    : 
    flash_addr
        Flash address location to write to. This address must be on a 256 byte
        boundary.
    buffer_addr
        Address location of data buffer to write into flash.
    bytes
        The number of bytes to write. You must always pass a multiple of 256
        bytes for programming.
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
        0x02 = (ROM AREA) Number of bytes is not divisible by 256
        0x03 = (ROM AREA) Flash address not on a 256 byte boundary
        0x04 = (Data Flash AREA) Number of bytes not divisible by 8
        0x05 = (Data Flash AREA) Flash address not on 8 byte boundary
        0x06 = Invalid address
        0x07 = (ROM AREA) Cannot write over 1MB boundary at 0xFFF00000
******************************************************************************/
uint8_t R_FlashWrite ( uint32_t flash_addr, uint32_t buffer_addr,
                       uint16_t bytes )
{
    /* Declare result container and number of bytes to write variables */
    uint8_t result = 0, num_byte_to_write;

    /* Take off upper byte since for programming/erase addresses for ROM are 
        the same as read addresses except upper byte is masked off to 0's.
        Data Flash addresses are not affected. */
    flash_addr &= 0x00FFFFFF;

    /* ROM area or Data Flash area - Check for DF first */  
    if ( flash_addr >= DF_ADDRESS && flash_addr < DF_ADDRESS + DF_SIZE )
    {
        /* Check if the number of bytes were passed is a multiple of 8 */
        if ( bytes & 0x07 )
        {
            /* Return 4, number of bytes not a multiple of 8 */
            return 4;
        }
        /* Check for an address on a 8 byte page boundary. */
        if ( (uint16_t)flash_addr & 0x07)
        {
            /* Return 5, address not on an 8 byte boundary */
            return 5;
        }
    }
    /* Check for ROM area */
    else if (    (flash_addr >= ROM_PE_ADDR)
                 &&    (flash_addr < ROM_PE_ADDR + ROM_SIZE) )
    {
        /* Check if the number of bytes were passed is a multiple of 256 */
        if ( bytes & 0xFF )
        {
            /* Return 2, number of bytes not a multiple of 256 */
            return 2;
        }

        /* Check for an address on a 256 byte page */
        if ( (uint16_t)flash_addr & 0xFF)
        {
            /* Return 3, address not on a 256 byte boundary */
            return 3;    
        }

        /* Check for passing over 1MB boundary at 0xFFF00000 */
        if (        (flash_addr < (0x00F00000))
                    &&    ((flash_addr + bytes) > 0x00F00000) )
        {
            /* Return 7, cannot write across a 1MB boundary */
            return 7;
        }
    } else
    {
        /* Return 6, invalid flash address */
        return 6;
    }

    /* If FCU firmware has already been transferred to FCU RAM,
        no need to do it again */
    if ( !fcu_transfer_complete )
    {
        /* If FCU firmware has not been transferred,
            then transfer from FCU ROM to FCU RAM. */
        result = _Flash_Init();    
    }

    /* Make sure we are not in the middle of another operation */
    if ( current_mode != READ_MODE )
    {
        /* Flash operation in progress - return 1, operation failure */
        return 1;
    }

    /* Do we want to program a DF area or ROM area? */
    if ( flash_addr < block_addresses[ROM_NUM_BLOCKS-1] )
    {
        /* Set current FCU mode to data flash PE */
        current_mode = FLD_PE_MODE;
    } else
    {
        /* Set FCU to ROM PE mode */
        current_mode = ROM_PE_MODE;
    }

    /* Enter PE mode, check if operation is successful */
    if ( _Enter_PE_Mode( flash_addr, bytes ) != 0)
    {
        /* Mode change failure, set FCU mode to READ */
        current_mode = READ_MODE;

        /* Return 1, operation failure */
        return 1;
    }

    /* Cancel the ROM Protect feature 
       NOTE: If you are using block locking feature to protect your data,
       remove the following line */
    FLASH.FPROTR.WORD = 0x5501;

    /* Check if FCU mode is set to data flash PE */
    if ( current_mode == FLD_PE_MODE )
    {
        /* Iterate while there are still bytes remaining to write */
        while ( bytes )
        {
            /* Check if address is on a 128 byte boundary, and there are
               at least 128 bytes remaining to write */
            if ( (bytes >= 128) && (((uint8_t)flash_addr & 0x7F) == 0x00))
            {
                /* Set the next data transfer size to be 128 */
                num_byte_to_write = 128;
            } else
            {    /* Set the next data transfer size to be 8 */
                num_byte_to_write = 8;
            }

            /* Call the Programming function, store the operation status in the
               container variable, result */
            result = _DataFlash_Write( flash_addr, buffer_addr,
                                       num_byte_to_write);

            /* Check the container variable result for errors */
            if ( result != 0x00 )
            {
                /* Data flash write error detected, break from flash write
                   while loop prematurely */
                break;
            }

            /* Increment the flash address and the buffer address by the size
               of the transfer thats just completed */
            flash_addr += num_byte_to_write;
            buffer_addr += num_byte_to_write;

            /* Decrement the number of bytes remaining by the size of the last
               flash write */
            bytes -= num_byte_to_write;
        }
    }
    /* Catch-all - FCU mode must be ROM PE */
    else
    {
        /* Iterate loop while there are still bytes remaining to write */
        while ( bytes )
        {
            /* Call the Programming function */
            result = _ROM_Write(flash_addr, buffer_addr);

            /* Check for errors */
            if ( result != 0x00 )
            {
                /* Stop programming */
                break;    
            }

            /* Increment the flash address and the buffer address by the size
               of the transfer thats just completed */
            flash_addr += 256;
            buffer_addr += 256;

            /* Decrement the number of bytes remaining by the size of the last
               flash write */        
            bytes -= 256;
        }
    }

    /* Leave Program/Erase Mode */
    _Exit_PE_Mode();

    /* Set current FCU mode to READ */
    current_mode = READ_MODE;

