FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Flash.c
    /* Return flash programming result */
    return result;
}
/******************************************************************************
End of function  R_FlashWrite
******************************************************************************/

/******************************************************************************
* Function Name: _Notify_Peripheral_Clock
* Description  : Notifies FCU or Peripheral Clock (PCLK)
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.
* Arguments    : 
    flash_addr
        Flash address you will be erasing or writing to
* Return Value : 
        0x00 = Operation Successful
        0x01 = Operation Failed
******************************************************************************/
static uint8_t _Notify_Peripheral_Clock(volatile uint8_t * flash_addr)
{
    /* Declare wait counter variable */
    int32_t wait_cnt;

    /* Notify Peripheral Clock(PCK) */
    /* Set frequency of PCK */
    FLASH.PCKAR.WORD = PCLK_FREQUENCY/1000000;            

    /* Execute Peripheral Clock Notification Commands */
    *flash_addr = 0xE9;            
    *flash_addr = 0x03;
    *(uint16_t far *)flash_addr = 0x0F0F;
    *(uint16_t far *)flash_addr = 0x0F0F;
    *(uint16_t far *)flash_addr = 0x0F0F;
    *flash_addr = 0xD0;

    /* Set timeout wait duration */
    wait_cnt = WAIT_t10USEC;

    /* Check FRDY */
    while (FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement wait counter */
        wait_cnt--;                                

        /* Check if wait counter has reached zero */
        if (wait_cnt == 0)
        {
            /* Timeout duration elapsed, assuming operation failure - Reset
               FCU */
            _Flash_Reset();                        

            /* Return 1, operation failure  */
            return 1;
        }
    }

    /* Check ILGLERR */
    if (FLASH.FSTATR0.BIT.ILGLERR == 1)
    {
        /* Return 1, operation failure*/
        return 1;
    }

    /* Return 1, operation success */
    return 0;
}
/******************************************************************************
End of function _Notify_Peripheral_Clock
******************************************************************************/

/******************************************************************************
* Function Name: _Flash_Reset
* Description  : Reset the FCU.
    NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
    but if you are ONLY doing Data Flash programming, this function can reside
    and execute in Flash.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void _Flash_Reset(void)
{
    /* Declare wait counter variable */
    int32_t    wait_cnt;

    /* Reset the FCU */
    FLASH.FRESETR.WORD = 0xCC01;

    /* Give FCU time to reset */
    wait_cnt = WAIT_tRESW;

    /* Wait until the timer reaches zero */
    while (wait_cnt != 0)
    {
        /* Decrement the timer count each iteration */
        wait_cnt--;
    }

    /* FCU is not reset anymore */
    FLASH.FRESETR.WORD = 0xCC00;
}
/******************************************************************************
End of function  _Flash_Reset
******************************************************************************/

/*******************************************************************************
* Outline      : Erase_FlashData
* Description  : This function enters a for loop, and erases a block of data
*                 flash memory each iteration until all blocks have been erased.
* Argument     : none
* Return value : none
*******************************************************************************/
void Erase_FlashData(void)
{
    /* Declare flash API error flag */
    uint8_t ret = 0;

    /* Declare loop count and block count variables */
    uint8_t loop_counter = 0, block_count = BLOCK_DB0;

    uint32_t address = 0x00000000;

    /* Initialise a for loop to erase each of the data flash blocks */
    for (loop_counter = 0; loop_counter < DF_NUM_BLOCKS; loop_counter++)
    {
        /* Fetch beginning address of DF block */  
        address = block_addresses[BLOCK_DB0 + loop_counter];

        /* Erase data flash block */
        ret |=     R_FlashErase
                   (
                   block_count
                   );    

        /* Check if data flash area is blank */
        ret |=    R_FlashDataAreaBlankCheck
                  (
                  address,
                  BLANK_CHECK_ENTIRE_BLOCK
                  );

        /* Increment block counter */
        block_count++;
    }

    /* Check Blank Checking */
    ret |= R_FlashDataAreaBlankCheck
           (
           address,
           BLANK_CHECK_ENTIRE_BLOCK
           );

    /* Halt in while loop when flash API errors detected */
    while (ret);
}    
/*******************************************************************************
* End of function Erase_FlashData
*******************************************************************************/